-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: Jun 08, 2026 at 07:23 PM
-- Server version: 9.1.0
-- PHP Version: 8.3.14

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `blog_project`
--

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

DROP TABLE IF EXISTS `categories`;
CREATE TABLE IF NOT EXISTS `categories` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`) VALUES
(1, 'زندگی شخصی'),
(2, 'تکنولوژی'),
(3, 'برنامه‌نویسی'),
(4, 'شبکه'),
(5, 'روانشناسی'),
(6, 'سایبر سکیوریتی'),
(7, 'فلسفه'),
(8, 'پزشکی و بهداشت'),
(9, 'رسانه و هنر'),
(10, 'حمل ونقل'),
(11, 'حقوق و قضاوت');

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

DROP TABLE IF EXISTS `comments`;
CREATE TABLE IF NOT EXISTS `comments` (
  `id` int NOT NULL AUTO_INCREMENT,
  `post_id` int NOT NULL,
  `user_id` int NOT NULL,
  `comment_text` text COLLATE utf8mb3_persian_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `post_id` (`post_id`),
  KEY `user_id` (`user_id`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `posts`
--

DROP TABLE IF EXISTS `posts`;
CREATE TABLE IF NOT EXISTS `posts` (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `category_id` int DEFAULT NULL,
  `title` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `image` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`),
  KEY `category_id` (`category_id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `posts`
--

INSERT INTO `posts` (`id`, `user_id`, `category_id`, `title`, `content`, `image`, `created_at`) VALUES
(6, 12, 8, 'راهکار خانگی برای رفع بلغم؛ بهترین روش‌های طبیعی برای کاهش بلغم بدن', 'راهکار خانگی برای رفع بلغم چیست؟\r\n\r\nبلغم یکی از موضوعاتی است که در طب سنتی بسیار مورد توجه قرار گرفته و بسیاری از افراد معتقدند تجمع بیش از حد آن در بدن می‌تواند باعث بروز مشکلات مختلفی مانند خستگی، خواب‌آلودگی، سنگینی بدن، کاهش انرژی، مشکلات گوارشی و حتی افزایش وزن شود. به همین دلیل بسیاری از افراد به دنبال راهکار خانگی برای رفع بلغم هستند تا بدون استفاده از داروهای شیمیایی بتوانند تعادل بدن خود را حفظ کنند.\r\n\r\n\r\nبلغم چیست؟\r\n\r\nدر طب سنتی، بلغم یکی از چهار خلط اصلی بدن محسوب می‌شود. مزاج بلغم سرد و تر است و وجود آن برای عملکرد طبیعی بدن ضروری است. اما زمانی که مقدار آن بیش از حد افزایش پیدا کند، ممکن است علائمی در بدن ظاهر شود.\r\n\r\nافزایش بلغم معمولاً در اثر مصرف بیش از حد غذاهای سرد، کم‌تحرکی، خواب زیاد، مصرف لبنیات فراوان و نوشیدن آب سرد ایجاد می‌شود.\r\n\r\nعلائم افزایش بلغم در بدن\r\n\r\nقبل از اینکه به سراغ راهکار خانگی برای رفع بلغم برویم، بهتر است نشانه‌های آن را بشناسیم.\r\n\r\nبرخی از رایج‌ترین علائم عبارت‌اند از:\r\n\r\n- خواب‌آلودگی بیش از حد\r\n\r\n- احساس سنگینی بدن\r\n\r\n- ضعف و بی‌حالی\r\n\r\n- سردی دست و پا\r\n\r\n- کاهش تمرکز\r\n\r\n- افزایش ترشحات بینی\r\n\r\n- نفخ و مشکلات گوارشی\r\n\r\n- افزایش وزن\r\n\r\n- تمایل زیاد به خواب\r\n\r\n- کندی در انجام فعالیت‌ها\r\n\r\nوجود چند مورد از این علائم لزوماً به معنای غلبه بلغم نیست، اما در طب سنتی به عنوان نشانه‌های احتمالی شناخته می‌شوند.\r\n\r\nبهترین راهکار خانگی برای رفع بلغم\r\n\r\n1. مصرف آب گرم در طول روز\r\n\r\nیکی از ساده‌ترین و موثرترین روش‌ها برای کاهش بلغم، نوشیدن آب ولرم یا گرم است.\r\n\r\nآب گرم می‌تواند به بهبود عملکرد دستگاه گوارش کمک کرده و احساس سنگینی ناشی از مصرف غذاهای سرد را کاهش دهد.\r\n\r\nبهتر است صبح ناشتا یک لیوان آب گرم بنوشید و در طول روز نیز از نوشیدنی‌های خیلی سرد پرهیز کنید.\r\n\r\n2. استفاده از عسل طبیعی\r\n\r\nعسل از گذشته در طب سنتی برای کمک به متعادل کردن مزاج سرد مورد استفاده قرار گرفته است.\r\n\r\nمصرف یک قاشق عسل طبیعی همراه آب ولرم می‌تواند گزینه مناسبی برای افرادی باشد که به دنبال راهکار خانگی برای رفع بلغم هستند.\r\n\r\nعسل علاوه بر طعم مطلوب، به گرم‌تر شدن مزاج کمک می‌کند.\r\n\r\n3. زنجبیل؛ دشمن معروف بلغم\r\n\r\nزنجبیل یکی از مشهورترین گیاهان مورد استفاده در طب سنتی برای مقابله با سردی و رطوبت بدن است.\r\n\r\nروش مصرف:\r\n\r\n- دمنوش زنجبیل\r\n\r\n- افزودن زنجبیل به غذا\r\n\r\n- ترکیب زنجبیل و عسل\r\n\r\nمصرف متعادل زنجبیل می‌تواند احساس کسالت و بی‌حالی را کاهش دهد.\r\n\r\n4. دمنوش دارچین\r\n\r\nدارچین از جمله ادویه‌هایی است که طبع گرمی دارد و در بسیاری از نسخه‌های سنتی برای کاهش بلغم توصیه می‌شود.\r\n\r\nخواص دمنوش دارچین:\r\n\r\n- کمک به هضم غذا\r\n\r\n- کاهش احساس سردی\r\n\r\n- ایجاد انرژی بیشتر\r\n\r\n- کمک به بهبود گردش خون\r\n\r\n5. مصرف خرما\r\n\r\nخرما یکی از بهترین خوراکی‌های گرم محسوب می‌شود.\r\n\r\nمصرف روزانه چند عدد خرما به ویژه در فصل‌های سرد سال می‌تواند در کاهش علائم ناشی از غلبه بلغم مؤثر باشد.\r\n\r\nخرما علاوه بر انرژی بالا، مواد مغذی فراوانی نیز دارد.\r\n\r\n6. کاهش مصرف لبنیات\r\n\r\nدر طب سنتی لبنیات از جمله خوراکی‌های سرد محسوب می‌شوند.\r\n\r\nافرادی که به دنبال رفع بلغم هستند بهتر است مصرف موارد زیر را کنترل کنند:\r\n\r\n- ماست\r\n\r\n- دوغ\r\n\r\n- شیر سرد\r\n\r\n- بستنی\r\n\r\nالبته حذف کامل این مواد توصیه نمی‌شود و بهتر است با نظر متخصص مصرف شوند.\r\n\r\n7. ورزش روزانه\r\n\r\nیکی از مهم‌ترین راهکارهای خانگی رفع بلغم، افزایش فعالیت بدنی است.\r\n\r\nتحرک مناسب باعث:\r\n\r\n- افزایش سوخت و ساز\r\n\r\n- بهبود گردش خون\r\n\r\n- کاهش احساس سنگینی\r\n\r\n- افزایش انرژی\r\n\r\nمی‌شود.\r\n\r\nپیاده‌روی روزانه حتی به مدت 30 دقیقه می‌تواند تأثیر قابل توجهی داشته باشد.\r\n\r\n8. پرهیز از خواب زیاد\r\n\r\nخواب بیش از حد از دیدگاه طب سنتی می‌تواند موجب افزایش رطوبت بدن شود.\r\n\r\nبرای کاهش بلغم:\r\n\r\n- شب‌ها زودتر بخوابید.\r\n\r\n- صبح‌ها زودتر بیدار شوید.\r\n\r\n- از خواب طولانی در طول روز پرهیز کنید.\r\n\r\n9. مصرف سیاه‌دانه\r\n\r\nسیاه‌دانه در طب سنتی جایگاه ویژه‌ای دارد.\r\n\r\nترکیب سیاه‌دانه آسیاب شده با عسل یکی از نسخه‌های پرطرفدار برای افرادی است که از سردی مزاج و علائم بلغم شکایت دارند.\r\n\r\n10. دمنوش آویشن\r\n\r\nآویشن یکی از گیاهان معطر و گرم است که برای کمک به تعادل مزاج مورد استفاده قرار می‌گیرد.\r\n\r\nدمنوش آویشن می‌تواند:\r\n\r\n- بهبود هضم غذا\r\n\r\n- کاهش نفخ\r\n\r\n- ایجاد احساس سبکی\r\n\r\nرا به همراه داشته باشد.\r\n\r\nبرای رفع بلغم چه غذاهایی بخوریم؟\r\n\r\nانتخاب غذاهای مناسب نقش مهمی در کاهش بلغم دارد.\r\n\r\nبرخی از خوراکی‌های توصیه‌شده عبارت‌اند از:\r\n\r\n- زنجبیل\r\n\r\n- دارچین\r\n\r\n- خرما\r\n\r\n- عسل\r\n\r\n- کشمش\r\n\r\n- گوشت گوسفند\r\n\r\n- نخود\r\n\r\n- ارده\r\n\r\n- کنجد\r\n\r\n- مغز گردو\r\n\r\n- فلفل سیاه\r\n\r\n- آویشن\r\n\r\nمصرف متعادل این مواد می‌تواند به حفظ تعادل مزاج کمک کند.\r\n\r\nبرای رفع بلغم چه غذاهایی نخوریم؟\r\n\r\nدر کنار مصرف خوراکی‌های مفید، محدود کردن برخی مواد غذایی نیز اهمیت دارد.\r\n\r\nمانند:\r\n\r\n- بستنی\r\n\r\n- نوشابه‌های سرد\r\n\r\n- ماست زیاد\r\n\r\n- دوغ\r\n\r\n- خیار\r\n\r\n- هندوانه\r\n\r\n- غذاهای بسیار چرب\r\n\r\n- غذاهای فرآوری‌شده\r\n\r\n- نوشیدنی‌های یخی\r\n\r\nبهترین صبحانه برای افراد بلغمی\r\n\r\nصبحانه نقش مهمی در تنظیم مزاج دارد.\r\n\r\nنمونه صبحانه مناسب:\r\n\r\n- نان سنگک\r\n\r\n- عسل طبیعی\r\n\r\n- ارده\r\n\r\n- دارچین\r\n\r\n- چای کم‌رنگ\r\n\r\n- خرما\r\n\r\nاین ترکیب می‌تواند انرژی مناسبی برای شروع روز فراهم کند.\r\n\r\nبهترین نوشیدنی برای رفع بلغم\r\n\r\nاگر به دنبال بهترین نوشیدنی برای رفع بلغم هستید، گزینه‌های زیر محبوبیت زیادی دارند:\r\n\r\nدمنوش زنجبیل\r\n\r\nگرم‌کننده و انرژی‌بخش.\r\n\r\nدمنوش دارچین\r\n\r\nکمک‌کننده به هضم غذا.\r\n\r\nدمنوش آویشن\r\n\r\nمناسب برای کاهش احساس سنگینی.\r\n\r\nآب گرم و عسل\r\n\r\nیکی از ساده‌ترین و در دسترس‌ترین گزینه‌ها.\r\n\r\nنقش سبک زندگی در کاهش بلغم\r\n\r\nبسیاری از افراد تصور می‌کنند فقط غذاها باعث افزایش بلغم می‌شوند، اما سبک زندگی نیز نقش مهمی دارد.\r\n\r\nموارد زیر می‌توانند مفید باشند:\r\n\r\n- خواب منظم\r\n\r\n- ورزش روزانه\r\n\r\n- کاهش استرس\r\n\r\n- مصرف غذا در ساعات مشخص\r\n\r\n- پرهیز از پرخوری\r\n\r\n- جویدن کامل غذا\r\n\r\nآیا کاهش وزن به رفع بلغم کمک می‌کند؟\r\n\r\nدر طب سنتی اضافه وزن گاهی با افزایش رطوبت بدن مرتبط دانسته می‌شود.\r\n\r\nبه همین دلیل رعایت رژیم غذایی متعادل و فعالیت بدنی منظم می‌تواند علاوه بر کمک به کنترل وزن، احساس سبکی بیشتری ایجاد کند.\r\n\r\nنکات مهم برای جلوگیری از بازگشت بلغم\r\n\r\nاگر می‌خواهید دوباره دچار علائم افزایش بلغم نشوید، این نکات را رعایت کنید:\r\n\r\n1. مصرف آب یخ را کاهش دهید.\r\n\r\n2. تحرک روزانه داشته باشید.\r\n\r\n3. خواب کافی اما نه بیش از حد داشته باشید.\r\n\r\n4. مصرف لبنیات را متعادل کنید.\r\n\r\n5. از پرخوری پرهیز کنید.\r\n\r\n6. غذا را آرام و کامل بجوید.\r\n\r\n7. از مصرف مداوم خوراکی‌های بسیار سرد خودداری کنید.\r\n\r\nجمع‌بندی\r\n\r\nراهکار خانگی برای رفع بلغم معمولاً بر اصلاح سبک زندگی، تغذیه مناسب و استفاده از برخی گیاهان و ادویه‌های گرم متمرکز است. مصرف آب گرم، عسل، زنجبیل، دارچین، آویشن و خرما در کنار ورزش منظم، خواب متعادل و کاهش مصرف خوراکی‌های سرد می‌تواند به بهبود احساس سنگینی و بی‌حالی کمک کند.\r\n\r\nالبته باید توجه داشت که علائمی مانند خستگی مداوم، افزایش وزن، خواب‌آلودگی یا مشکلات گوارشی ممکن است دلایل پزشکی مختلفی داشته باشند؛ بنابراین در صورت تداوم علائم، مراجعه به پزشک یا متخصص تغذیه ضروری است.', NULL, '2026-06-08 19:02:54'),
(7, 13, 10, 'از شیر مرغ تا جان آدمیزاد برای KMC J7؛ قطعاتی که فکرش را هم نمی‌کنید موجود است!', '\r\nخودروی KMC J7 به عنوان یکی از زیباترین و مدرن‌ترین سدان‌های فست‌بک بازار ایران، طرفداران زیادی را در میان رانندگان خوش‌سلیقه و به‌ویژه رده سنی ۳۰ تا ۵۰ سال پیدا کرده است. این خودرو با طراحی تهاجمی، موتور قدرتمند توربو شارژر (TGDI) و آپشن‌های رفاهی فراوان، حس و حال یک رانندگی اسپرت و در عین حال لوکس را هدیه می‌دهد.\r\n\r\nاما واقعیت این است که نگهداری از یک سدان مدرن و پیچیده مانند کی‌ام‌سی جی ۷، دغدغه‌های خاص خود را دارد. حساسیت موتورهای توربو به کیفیت سوخت، پیچیدگی گیربکس‌های دوکلاچه (DCT) و از همه مهم‌تر، کمیاب بودن قطعات بدنه و سنسورهای هوشمند این خودرو در بازار سنتی، بسیاری از مالکان را با چالش مواجه کرده است.\r\n\r\nاگر شما هم مالک این فست‌بک جذاب هستید و دغدغه تأمین قطعات اصلی آن را دارید، جای درستی آمده‌اید. ما در فروشگاه اتویار، تمام لوازم یدکی KMC J7 را از پیشرانه تا بدنه فراهم کرده‌ایم تا بدون دغدغه، از سواری با خودروی خود لذت ببرید.\r\nچرا تأمین قطعات KMC J7 یک کار تخصصی است؟\r\nقطعات کی ام سی جی 7\r\nقطعات کی ام سی جی 7\r\n\r\nبرخلاف خودروهای قدیمی و تنفس طبیعی، خودروهای مدرنی مثل KMC J7 دارای سیستم‌های الکترونیکی بسیار پیشرفته، سنسورهای رادار، و موتوری با تزریق مستقیم سوخت هستند. کوچک‌ترین ناسازگاری در قطعات یدکی، لنت ترمز یا حتی فیلترهای مصرفی می‌تواند سیستم کامپیوتر مرکزی خودرو (ECU) را دچار اختلال کند یا به توربوشارژر آسیب جدی بزند.\r\n\r\nبنابراین، خرید قطعه برای جی ۷ دیگر با گشت‌وگذار ساده در بازار چراغ‌برق و اعتماد به حرف دلالان همخوانی ندارد. شما به مرجعی نیاز دارید که قطعه را با کد فنی دقیق خط تولید (OEM) به شما تحویل دهد.\r\nدسته‌بندی قطعات موجود KMC J7 در انبار اتویار\r\n\r\nاصطلاح «از شیر مرغ تا جان آدمیزاد» در اتویار یک شعار نیست، یک واقعیت است. ما انبار خود را بر اساس نیازهای واقعی و حیاتی رانندگان J7 دسته‌بندی کرده‌ایم:\r\n۱. قطعات حیاتی موتور توربو (TGDI) و گیربکس DCT\r\n\r\nموتور ۱.۵ لیتری توربو این خودرو قدرت بالایی تولید می‌کند اما نیاز به مراقبت شدید دارد. در اتویار قطعات زیر کاملاً موجود است:\r\n\r\nمجموعه کامل توربوشارژر و اینترکولر.\r\n\r\nقطعات کیت کلاچ و ساعتی گیربکس دوکلاچه KMC J7.\r\n\r\nواشر سرسیلندر اصلی، رینگ و پیستون استاندارد.\r\n۲. قطعات بدنه، فست‌بک و سیستم‌های روشنایی\r\n\r\nطراحی خاص عقب J7 و چراغ‌های پیوسته آن، در تصادفات بیشترین آسیب را می‌بینند. نیازی به انتظار طولانی برای قطعات شرکتی نیست:\r\n\r\nسپر جلو و عقب، جلوپنجره پیانویی و دیفیوزر عقب.\r\n\r\nچراغ‌های جلو تمام LED و نوار چراغ یکپارچه عقب.\r\n\r\nآینه‌های جانبی تاشو برقی مجهز به گرمکن و دوربین ۳۶۰ درجه.\r\n۳. قطعات جلوبندی و سیستم پایداری\r\n\r\nبرای حفظ هندلینگ فوق‌العاده و چسبندگی جی ۷ در پیچ‌ها، قطعات زیر را با بالاترین کیفیت موجود کرده‌ایم:\r\n\r\nکمک‌فنرهای جلو و عقب هیدرولیکی.\r\n\r\nطبق‌های کامل، سیبک فرمان و میل موج‌گیر.\r\n\r\nدیسک چرخ و لنت ترمزهای سرامیکی بدون صدا.\r\nاستهلاک KMC J7؛ چه چیزهایی را باید جدی بگیریم؟\r\n\r\nبه عنوان یک راننده باارزش و با تجربه در رده سنی ۳۰ تا ۵۰ سال، قطعاً می‌دانید که پیشگیری بهتر از درمان است. خودروی جی ۷ به دلیل داشتن گیربکس دوکلاچه، در ترافیک‌های سنگین کلان‌شهرها ممکن است با داغ شدن گیربکس مواجه شود. استفاده از فیلتر روغن گیربکس اصلی و تعویض به موقع روغن آن، عمر این سیستم گران‌قیمت را دو برابر می‌کند.\r\n\r\nهمچنین، سیستم تعلیق این خودرو به دلیل جاده‌های پر از دست‌انداز، پس از مدتی نیاز به بازبینی دارد. تعویض به موقع بوش طبق‌ها و لاستیک‌های چاکدار مانع از آسیب رسیدن به کمک‌فنرهای اصلی خودرو می‌شود.\r\nچرا اتویار انتخاب اول مالکان حرفه‌ای KMC J7 است؟\r\nلوازم یدکی کی ام سی جی 7\r\nلوازم یدکی کی ام سی جی 7\r\n\r\nخرید از اتویار صرفاً یک تراکنش مالی نیست؛ بلکه شروع یک پشتیبانی فنی همه‌جانبه برای خودروی شماست:\r\n\r\nتضمین اصالت قطعات (بدون قید و شرط): ما می‌دانیم که قطعه فیک چه بلایی سر موتور توربو می‌آورد. تمامی قطعات اتویار با ضمانت اصالت کالا و سلامت فیزیکی ارائه می‌شوند.\r\n\r\nقیمت‌های منصفانه و واردات مستقیم: اتویار با حذف زنجیره دلالان، قطعات KMC J7 را به صورت مستقیم وارد کرده و با قیمتی رقابتی به دست شما می‌رساند.\r\n\r\nارسال سریع به تمام نقاط ایران: فرقی نمی‌کند در ترافیک تهران هستید یا در جاده‌های شمال و جنوب؛ قطعه مورد نظر شما در سریع‌ترین زمان ممکن (ارسال فوری در تهران و ۲۴ تا ۴۸ ساعته برای شهرستان‌ها) به دستتان خواهد رسید.\r\n\r\nمشاوره تلفنی تخصصی: قبل از واریز هرگونه وجه، می‌توانید با کارشناسان فنی ما تماس بگیرید، شماره شاسی خودرو را اعلام کنید تا دقیقاً قطعه سازگار با مدل خودروی شما برایتان ارسال شود.\r\nپرسش‌های متداول کاربران درباره قطعات KMC J7 (FAQ)\r\n\r\n۱. آیا قطعات ظاهری و بدنه KMC J7 مانند چراغ جلو و سپر در اتویار موجود است؟\r\n\r\nبله، برخلاف بازار آزاد که قطعات بدنه جی ۷ در آن بسیار کمیاب است، اتویار تمام قطعات بدنه، سپرها، جلوپنجره و سیستم‌های روشنایی این خودرو را به طور کامل در انبار خود موجود دارد.\r\n\r\n۲. آیا استفاده از لنت ترمزهای معمولی برای جی ۷ مشکلی ایجاد می‌کند؟\r\n\r\nبه دلیل شتاب و وزن خودروی KMC J7، استفاده از لنت‌های معمولی باعث داغ شدن سریع، سوت کشیدن و کاهش شدید قدرت ترمزگیری می‌شود. در اتویار فقط لنت‌های سرامیکی و فابریک استاندارد این خودرو عرضه می‌شود.\r\n\r\n۳. چگونه می‌توانم از اصالت قطعه خریداری شده مطمئن شوم؟\r\n\r\nتمامی قطعات ارائه شده در اتویار دارای بسته‌بندی استاندارد، کدهای فنی هولوگرام‌دار و ضمانت معتبر اصالت کالا هستند. همچنین مکانیک شما می‌تواند قبل از نصب، اصالت فیزیکی قطعه را بررسی کند.\r\n\r\n۴. روند ارسال قطعات به شهرستان‌ها چگونه است؟\r\n\r\nسفارشات شهرستان‌ها بلافاصله پس از ثبت، بسته‌بندی شده و از طریق سیستم‌های باربری مطمئن، تیپاکس یا پست پیشتاز ارسال می‌شوند تا ظرف حداکثر ۴۸ ساعت به دست شما برسند.\r\nهمین حالا خودروی خود را بیمه کنید؛ از اتویار خرید کنید!\r\n\r\nیک خودروی لوکس و پرقدرت مثل KMC J7 شایسته بهترین قطعات است. اجازه ندهید نبود یک قطعه کوچک یا استفاده از لوازم یدکی بی‌کیفیت، عملکرد این فست‌بک جذاب را ضعیف کند.\r\n\r\nبرای مشاهده لیست کامل قطعات، مقایسه قیمت‌ها و ثبت سفارش، همین حالا از طریق لینک زیر وارد دسته‌بندی اختصاصی KMC J7 شوید. همچنین می‌توانید برای دریافت مشاوره فنی رایگان و استعلام تلفنی با کارشناسان فروش اتویار تماس بگیرید. ما تا آخرین قدم نگهداری از خودرویتان در کنار شما هستیم.\r\n\r\n[ 09903338473 ]', NULL, '2026-06-08 19:09:23');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
CREATE TABLE IF NOT EXISTS `users` (
  `id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(50) NOT NULL,
  `email` varchar(100) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` enum('user','admin') DEFAULT 'user',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`),
  UNIQUE KEY `email` (`email`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `email`, `password`, `role`, `created_at`) VALUES
(1, 'admin', 'admin@admin.com', 'admin', 'admin', '2026-06-08 18:24:03'),
(12, 'matin', 'matin@gmail.com', '123456789', 'user', '2026-06-08 19:00:05'),
(13, 'samin_salemi', 'samin_salemi@gmail.com', '123456789', 'user', '2026-06-08 19:05:40');

--
-- Constraints for dumped tables
--

--
-- Constraints for table `posts`
--
ALTER TABLE `posts`
  ADD CONSTRAINT `posts_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `posts_ibfk_2` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE SET NULL;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
